Revit 2026 API

# IFCParameterTemplateResetActiveTemplate Method

---

Removes the information about active mapping temple of the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void ResetActiveTemplate(
	Document document
)
```
```vb
Public Shared Sub ResetActiveTemplate (
	document As Document
)
```
```cpp
public:
static void ResetActiveTemplate(
	Document^ document
)
```
```fsharp
static member ResetActiveTemplate :
        document : Document -> unit
```

#### Parameters

document Document
     The document to set.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

After calling this method, the active template of the document will be , which means that in-session template should be used.

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace